# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [4]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_names = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv")

### Step 4. See the first 10 entries

In [3]:
baby_names.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [7]:
baby_names.drop(columns=["Unnamed: 0", "Id"], inplace=True)

### Step 6. Is there more male or female names in the dataset?

In [8]:
baby_names["Gender"].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [15]:
names = baby_names.groupby("Name")

### Step 8. How many different names exist in the dataset?

In [16]:
names = names.sum()

### Step 9. What is the name with most occurrences?

In [17]:
names.sort_values("Count", ascending=False)

               Year   Count
Name
Jacob       1141099  242874
Emma        1137085  214852
Michael     1161152  214405
Ethan       1139091  209277
Isabella    1137090  204798
...             ...     ...
Eniola         2012       5
Atlantis       2005       5
Marci          2004       5
Simarpreet     2011       5
Nita           2007       5

[17632 rows x 2 columns]

### Step 10. How many different names have the least occurrences?

In [18]:
names.sort_values("Count", ascending=True)

             Year   Count
Name
Destenie     2006       5
Janisha      2005       5
Lizvet       2004       5
Arsalan      2005       5
Janira       2006       5
...           ...     ...
Isabella  1137090  204798
Ethan     1139091  209277
Michael   1161152  214405
Emma      1137085  214852
Jacob     1141099  242874

[17632 rows x 2 columns]

### Step 11. What is the median name occurrence?

In [20]:
names[names["Count"] == 5]

names.median()

Year     16061.0
Count       49.0
dtype: float64

### Step 12. What is the standard deviation of names?

In [22]:
names.std()

Year     245161.817178
Count     11006.069468
dtype: float64

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [23]:
names.describe()

               Year          Count
count  1.763200e+04   17632.000000
mean   1.158117e+05    2008.932169
std    2.451618e+05   11006.069468
min    2.004000e+03       5.000000
25%    4.017000e+03      11.000000
50%    1.606100e+04      49.000000
75%    7.846425e+04     337.000000
max    2.233993e+06  242874.000000